00009                                                                   ABENDWS
00010  01  ABEND-USER-ELEMENTS.                                         ABENDWS
00011      05 ABEND-PROG-NAME                 PIC X(08).                ABENDWS
00012      05 ABEND-USER-CODE                 PIC S9(04) COMP.          ABENDWS
00013      05 ABEND-PARA-NAME                 PIC X(32).                ABENDWS
00014      05 ABEND-USER-MSG                  PIC X(80).                ABENDWS
