           MOVE WHEN-COMPILED TO WHEN-COMPILED-INFO                     09/06/91
           MOVE COMPILE-TME TO PROGRAM-TME                              COMPMOVE
           MOVE COMPILE-DT TO PROGRAM-DT                                   LV001
           DISPLAY PROGRAM-INFO.                                        COMPMOVE
