       01  COS-MATRIX.                                                  00180014
           05  FILLER                              PIC X(57) VALUE      00190054
           '01AINPAT GENL HOSP  00                                   '. 00200054
           05  FILLER                              PIC X(57) VALUE      00210054
           '                    01ICTYPEV01                          '. 00220054
           05  FILLER                              PIC X(57) VALUE      00230054
           '                    02IPTYPEV60                          '. 00240054
           05  FILLER                              PIC X(57) VALUE      00250054
           '01BINPAT OTHER HOSP 00                                   '. 00260056
           05  FILLER                              PIC X(57) VALUE      00270054
           '                    01ICTYPEV01                          '. 00280054
           05  FILLER                              PIC X(57) VALUE      00290054
           '                    02IPTYPEV65                          '. 00300075
           05  FILLER                              PIC X(57) VALUE      00310053
           '02 RES TREATMNT CNTR00                                   '. 00320056
           05  FILLER                              PIC X(57) VALUE      00330053
           '                    01IPTYPEV59                          '. 00340053
           05  FILLER                              PIC X(57) VALUE      00350053
           '                    02EPSTATV641                         '. 00360053
           05  FILLER                              PIC X(57) VALUE      00370054
           '03AINPAT MH - GVNMNT00                                   '. 00380054
           05  FILLER                              PIC X(57) VALUE      00390054
           '                    01IPTYPEV64     69                   '. 00400054
           05  FILLER                              PIC X(57) VALUE      00410059
           '                    02ICTYPEV01     02                   '. 00420059
           05  FILLER                              PIC X(57) VALUE      00430054
           '                    03IFACCCV4      5      6      9      '. 00440059
           05  FILLER                              PIC X(57) VALUE      00450054
           '03CINPAT MH - OTHER 00                                   '. 00460054
           05  FILLER                              PIC X(57) VALUE      00470054
           '                    01IPTYPEV64     69                   '. 00480054
           05  FILLER                              PIC X(57) VALUE      00490059
           '                    02ICTYPEV01     02                   '. 00500059
           05  FILLER                              PIC X(57) VALUE      00510054
           '                    03EFACCCV4      5      6      9      '. 00520059
           05  FILLER                              PIC X(57) VALUE      00530053
           '04AOUTPAT / EPSDT   00                                   '. 00540054
           05  FILLER                              PIC X(57) VALUE      00550054
           '                    01ICTYPEV03                          '. 00560059
           05  FILLER                              PIC X(57) VALUE      00570054
           '                    02ECLINCV27                          '. 00580059
           05  FILLER                              PIC X(57) VALUE      00590054
           '04BOUTPAT - CLINC 2700                                   '. 00600054
           05  FILLER                              PIC X(57) VALUE      00610054
           '                    01ICTYPEV03                          '. 00620059
           05  FILLER                              PIC X(57) VALUE      00630054
           '                    02ICLINCV27                          '. 00640059
           05  FILLER                              PIC X(57) VALUE      00650055
           '04CEPSDT            00                                   '. 00660055
           05  FILLER                              PIC X(57) VALUE      00670055
           '                    01IPTYPEV60     65                   '. 00680055
           05  FILLER                              PIC X(57) VALUE      00690055
           '                    02ICTYPEV13                          '. 00700055
           05  FILLER                              PIC X(57) VALUE      00710054
           '05 ICF-MR           00                                   '. 00720053
           05  FILLER                              PIC X(57) VALUE      00730053
           '                    01IPTYPEV88                          '. 00740053
           05  FILLER                              PIC X(57) VALUE      00750045
           '06 TARGTD CASE MGMT 00                                   '. 00760047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPSPECV819    822    824           '. 00780047
           05  FILLER                              PIC X(57) VALUE      00790053
           '                    01IPSPECV813                         '. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    02EPROCMVT1017TJ                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      00790053
           '                    01IPROCMVH0006HAT2022HA              '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02EPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00790053
           '07 NURSING FACILITY 00                                   '. 00800056
           05  FILLER                              PIC X(57) VALUE      00810053
           '                    01IPTYPEV80                          '. 00820053
           05  FILLER                              PIC X(57) VALUE      00830057
           '08ACOMM HLTH CLINIC 00                                   '. 00840057
           05  FILLER                              PIC X(57) VALUE      00850060
           '                    01IPSPECV950                         '. 00860060
           05  FILLER                              PIC X(57) VALUE      00870057
           '                    02IPTYPEV24                          '. 00880060
           05  FILLER                              PIC X(57) VALUE      00890060
           '                    03ICTYPEV13     18                   '. 00900060
           05  FILLER                              PIC X(57) VALUE      00910057
           '                    01IPROC V90792  90863  90887  96152  '. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             96158  96159  H0007  H0015  '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                             H0018                       '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VHA                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMV90832HA90837HA90846HA90847HA'. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMV90791AJ                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02EPMOD VHF     HE                   '. 01540000
           05  FILLER                              PIC X(57) VALUE      00910057
           '08BMNTL HLTH CLINIC 00                                   '. 00920057
           05  FILLER                              PIC X(57) VALUE      00930060
           '                    01IPSPECV920    940                  '. 00940060
           05  FILLER                              PIC X(57) VALUE      00950060
           '                    02IPTYPEV24                          '. 00960060
           05  FILLER                              PIC X(57) VALUE      00970060
           '                    03ICTYPEV18                          '. 00980060
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    04IPMOD VHH                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00930060
           '                    01IPSPECV940                         '. 00940060
           05  FILLER                              PIC X(57) VALUE      00950060
           '                    02IPTYPEV24                          '. 00960060
           05  FILLER                              PIC X(57) VALUE      00970060
           '                    03ICTYPEV13     18                   '. 00980060
           05  FILLER                              PIC X(57) VALUE      00990057
           '                    01IPROCMV90791HAH0010HAS9125HAH2015HM'. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH0045HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02EPMOD VTV                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00990057
           '                    01IPROCMV90832HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02EPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH2015HAH2016HA              '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VHN     HO                   '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROC VT2021                       '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V22     52     HN     HO     '. 01540000
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    03EPMOD VHI                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROC VY9996  Y9998                '. 00780047
           05  FILLER                              PIC X(57) VALUE      00930060
           '                    02IPSPECV825                         '. 00940060
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH2020HET2038HE            '.   00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VHU                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    03IPSPECV825                         '. 02160051
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVT2016HAT2033HA              '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD RU1     U5                   '. 01540000
           05  FILLER                              PIC X(57) VALUE      00990057
           '                    01IPROCMVT1028HA                     '. 01540000
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00990057
           '08COTHER CLINIC     00                                   '. 01000057
           05  FILLER                              PIC X(57) VALUE      01010060
           '                    01IPTYPEV24                          '. 01020060
           05  FILLER                              PIC X(57) VALUE      01030057
           '                    02ICTYPEV13     18                   '. 01040060
           05  FILLER                              PIC X(57) VALUE      01050063
           '                    03EPSPECV910                         '. 01060063
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    03EPROCMV90791AJ                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    03EPROCMV86580HA90791HA90792HA90832HA'. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             90837HA90846HA90847HA90863HA'.
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             90887HAH0001HAH0003HAH0006HA'.
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             H0007HAH0018HAH0049HAS9475HA'.
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMV90853HAT1006HA              '. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH0005HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VAJ                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      01070057
           '08DPDN - EPSDT      00                                   '. 01080057
           05  FILLER                              PIC X(57) VALUE      01090060
           '                    01IPTYPEV44                          '. 01100060
           05  FILLER                              PIC X(57) VALUE      01110057
           '                    02ICTYPEV18                          '. 01120060
           05  FILLER                              PIC X(57) VALUE      01130060
           '                    03IPROCMVS9123EPS9124EPZ1710EPZ1710WT'. 01160000
           05  FILLER                              PIC X(57) VALUE      01150060
           '                             Z1715WTZ1720WTZ1725WTZ1730WT'. 01180000
           05  FILLER                              PIC X(57) VALUE      01170053
           '                             Z1735EPZ1735WTZ1740WTZ1745WT'. 01200000
           05  FILLER                              PIC X(57) VALUE      01210000
           '09 OPTICAL APPLIANCE00                                   '. 01180053
           05  FILLER                              PIC X(57) VALUE      01190053
           '                    01ICTYPEV08                          '. 01200072
           05  FILLER                              PIC X(57) VALUE      01210055
           '10 PHYSICIAN        00                                   '. 01220055
           05  FILLER                              PIC X(57) VALUE      01230055
           '                    01IPTYPEV20     25                   '. 01240055
           05  FILLER                              PIC X(57) VALUE      01250062
           '                    02ICTYPEV04     13                   '. 01260062
           05  FILLER                              PIC X(57) VALUE      01310000
           '                    03EPROC RG0054  G0060  P0000  P9999  '. 01320002
           05  FILLER                              PIC X(57) VALUE      01330000
           '                             Q0111  Q0116  R0000  R6999  '. 01340002
           05  FILLER                              PIC X(57) VALUE      01350000
           '                             W7000  W8899  W8901  W8999  '. 01360002
           05  FILLER                              PIC X(57) VALUE      01370000
           '                             Y7433  Y7570  70000  79999  '. 01380002
           05  FILLER                              PIC X(57) VALUE      01390002
           '                             80000  89999  U0001  U0005  '. 01400002
           05  FILLER                              PIC X(57) VALUE      01390002
           '                            VG0001  G0026  G0027  36415  '. 01420002
           05  FILLER                              PIC X(57) VALUE      01430000
           '                             36430  36440  36450  36455  '. 01440002
           05  FILLER                              PIC X(57) VALUE      01450002
           '                             36460  S9122  T1001  G2023  '. 01460002
           05  FILLER                              PIC X(57) VALUE      01450002
           '                             G2024                       '. 01460002
           05  FILLER                              PIC X(57) VALUE      01270055
           '                    03EPROCMVS5101STS5102STS5120STS8990ST'. 01480000
           05  FILLER                              PIC X(57) VALUE      01290062
           '                             97535ST                     '. 01500000
           05  FILLER                              PIC X(57) VALUE      01310055
           '                    03EPROCMVH0004STS5135ST97532ST       '. 01520000
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    04EPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      01350053
           '11 DENTAL           00                                   '. 01360053
           05  FILLER                              PIC X(57) VALUE      01370053
           '                    01ICTYPEV11                          '. 01380053
           05  FILLER                              PIC X(57) VALUE      01390063
           '                    02EPTYPEV43                          '. 01400063
           05  FILLER                              PIC X(57) VALUE      01410051
           '12 FREE-STANDING ASC00                                   '. 01420051
           05  FILLER                              PIC X(57) VALUE      01430051
           '                    01IPSPECV910                         '. 01440056
           05  FILLER                              PIC X(57) VALUE      01450053
           '13 OPTOMETRY        00                                   '. 01460053
           05  FILLER                              PIC X(57) VALUE      01470053
           '                    01ICTYPEV21                          '. 01480072
           05  FILLER                              PIC X(57) VALUE      01490053
           '14 CHIROPRACTOR     00                                   '. 01500053
           05  FILLER                              PIC X(57) VALUE      01510053
           '                    01ICTYPEV05                          '. 01520053
           05  FILLER                              PIC X(57) VALUE      01530052
           '15 NURSE PRACTITONER00                                   '. 01540056
           05  FILLER                              PIC X(57) VALUE      01550052
           '                    01IPTYPEV70                          '. 01560052
           05  FILLER                              PIC X(57) VALUE      01570063
           '                    02EPROC RP0000  P9999  Q0111  Q0116  '. 01580063
           05  FILLER                              PIC X(57) VALUE      01590063
           '                             W8000  W8899  W8901  W8999  '. 01800000
           05  FILLER                              PIC X(57) VALUE      01810000
           '                             80000  89999  U0001  U0005  '. 01820000
           05  FILLER                              PIC X(57) VALUE      01810000
           '                            VG0001  80102  80173  82947  '. 01840000
           05  FILLER                              PIC X(57) VALUE      01850000
           '                             87850  G2023  G2024         '. 01860000
           05  FILLER                              PIC X(57) VALUE      01310000
           '                    02EPROCMV90832AJ90834AJ90837AJ90846AJ'. 01320002
           05  FILLER                              PIC X(57) VALUE      01330000
           '                             90847AJ90791AJ90853AJ90887AJ'. 01340002
           05  FILLER                              PIC X(57) VALUE      02910051
           '                    03EPMOD VHF     HE                   '. 03500000
           05  FILLER                              PIC X(57) VALUE      02010000
           '                    02EPSPECV613    614                  '. 02020000
           05  FILLER                              PIC X(57) VALUE      01310000
           '                    03EPROCMV90832HF90834HF90837HF90846HF'. 01320002
           05  FILLER                              PIC X(57) VALUE      01330000
           '                             90847HF90791HF90853HF90832HE'. 01340002
           05  FILLER                              PIC X(57) VALUE      01310000
           '                             90834HE90837HE90846HE90847HE'. 01320002
           05  FILLER                              PIC X(57) VALUE      01310000
           '                             90853HE90887HF90887HE90791HE'. 01320002
           05  FILLER                              PIC X(57) VALUE      02910051
           '                    04EPMOD VHH                          '. 03500000
           05  FILLER                              PIC X(57) VALUE      01610053
           '16 PSYCHOLOGIST     00                                   '. 01620053
           05  FILLER                              PIC X(57) VALUE      01630053
           '                    01ICTYPEV19                          '. 01640053
           05  FILLER                              PIC X(57) VALUE      01650064
           '                    02ESPROGV17                          '. 01660064
           05  FILLER                              PIC X(57) VALUE      01670064
           '                    03EPROC RY7433  Y7570                '. 01680064
           05  FILLER                              PIC X(57) VALUE      01670064
           '                            VS9122  T1001                '. 01680064
           05  FILLER                              PIC X(57) VALUE      01690052
           '                    03EPROCMVS5101STS5102STS5120STS8990ST'. 01960000
           05  FILLER                              PIC X(57) VALUE      01970000
           '                             97535ST                     '. 01980000
           05  FILLER                              PIC X(57) VALUE      01990000
           '                    03EPROCMVH0004STS5135ST97532ST       '. 02000000
           05  FILLER                              PIC X(57) VALUE      02010000
           '                    04EPMOD V22                          '. 02020000
           05  FILLER                              PIC X(57) VALUE      02010000
           '                    01IPSPECV611                         '. 02020000
           05  FILLER                              PIC X(57) VALUE      01310000
           '                    02IPROCMV90832AJ90834AJ90837AJ90846AJ'. 01320002
           05  FILLER                              PIC X(57) VALUE      01330000
           '                             90847AJ90791AJ90853AJ90887AJ'. 01340002
           05  FILLER                              PIC X(57) VALUE      02910051
           '                    03IPMOD VHF     HE                   '. 03500000
           05  FILLER                              PIC X(57) VALUE      02010000
           '                    01IPTYPEV70                       '.    02020000
           05  FILLER                              PIC X(57) VALUE      02010000
           '                    02IPSPECV613    614                  '. 02020000
           05  FILLER                              PIC X(57) VALUE      01310000
           '                    03IPROCMV90832HF90834HF90837HF90846HF'. 01320002
           05  FILLER                              PIC X(57) VALUE      01310000
           '                             90832HE90834HE90837HE90846HE'. 01320002
           05  FILLER                              PIC X(57) VALUE      01330000
           '                             90847HF90791HF90853HF90847HE'. 01340002
           05  FILLER                              PIC X(57) VALUE      01330000
           '                             90853HE90791HE90887HF90887HE'. 01340002
           05  FILLER                              PIC X(57) VALUE      02910051
           '                    04IPMOD VHH                          '. 03500000
           05  FILLER                              PIC X(57) VALUE      02030000
           '17 PODIATRIST       00                                   '. 01700053
           05  FILLER                              PIC X(57) VALUE      01710053
           '                    01ICTYPEV10                          '. 01720053
           05  FILLER                              PIC X(57) VALUE      01730053
           '                    02EPROC RR0000  R6999  W7000  W7999  '. 01740053
           05  FILLER                              PIC X(57) VALUE      01750053
           '                             70000  79999                '. 01760053
           05  FILLER                              PIC X(57) VALUE      01770053
           '18 PROSTHETC/ORTHOTC00                                   '. 01780056
           05  FILLER                              PIC X(57) VALUE      01790053
           '                    01ICTYPEV17                          '. 01800053
           05  FILLER                              PIC X(57) VALUE      01810053
           '19 MIDWIFERY        00                                   '. 01820053
           05  FILLER                              PIC X(57) VALUE      01830053
           '                    01IPTYPEV90                          '. 01840053
           05  FILLER                              PIC X(57) VALUE      01850064
           '                    02EPROC RP0000  P9999  Q0111  Q0116  '. 01860064
           05  FILLER                              PIC X(57) VALUE      01870064
           '                             W8000  W8899  W8901  W8999  '. 02220000
           05  FILLER                              PIC X(57) VALUE      02230000
           '                             80000  89999  U0001  U0005  '. 02240000
           05  FILLER                              PIC X(57) VALUE      02250000
           '                            VG0001  80102  80173  82947  '. 02260000
           05  FILLER                              PIC X(57) VALUE      02270000
           '                             87850  G2023  G2024         '. 02280000
           05  FILLER                              PIC X(57) VALUE      01890053
           '20ADRUGS-LTC        00                                   '. 01900048
           05  FILLER                              PIC X(57) VALUE      01910048
           '                    01IPTYPEV26                          '. 01920048
           05  FILLER                              PIC X(57) VALUE      01930049
           '22ADAY TRAINING     00                                   '. 01940050
           05  FILLER                              PIC X(57) VALUE      01950050
           '                    01IPSPECV725                         '. 01960050
           05  FILLER                              PIC X(57) VALUE      01970049
           '22BEARLY INTERVENTN 00                                   '. 01980050
           05  FILLER                              PIC X(57) VALUE      01990050
           '                    01IPSPECV730                         '. 02000050
           05  FILLER                              PIC X(57) VALUE      02010049
           '22CSPECIAL EDUCATION00                                   '. 02020050
           05  FILLER                              PIC X(57) VALUE      02030050
           '                    01IPSPECV740                         '. 02040050
           05  FILLER                              PIC X(57) VALUE      02050049
           '22EPACT             00                                   '. 02060050
           05  FILLER                              PIC X(57) VALUE      02070050
           '                    01IPSPECV908                         '. 02080050
           05  FILLER                              PIC X(57) VALUE      02090048
           '23ACSOCI            00                                   '. 02100048
           05  FILLER                              PIC X(57) VALUE      02110048
           '                    01IPTYPEV59                          '. 02120051
           05  FILLER                              PIC X(57) VALUE      02130048
           '                    02IPSTATV641                         '. 02140051
           05  FILLER                              PIC X(57) VALUE      02150048
           '                    01IPROC RY9930  Y9995                '. 02160051
           05  FILLER                              PIC X(57) VALUE      02170048
           '                            VZ5008                       '. 02180048
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH0017HUH0017HWH0018HUH0019HU'. 00780047
           05  FILLER                              PIC X(57) VALUE      02190051
           '                             H0019HWH0037HWH0043HUH0043HW'. 00780047
           05  FILLER                              PIC X(57) VALUE      02190051
           '                             H2013HUH2020HUT2023TJT2038HU'. 00780047
           05  FILLER                              PIC X(57) VALUE      02190051
           '                             T2038HW                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH0043HU                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH0019HUH2020HW              '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V52                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH2020HAH2020HET2038HAT2038HE'. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VHW                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPSPECR891    905                  '. 02160051
           05  FILLER                              PIC X(57) VALUE      02170048
           '                            V813    907                  '. 02180048
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROC VY9997  Y9999                '. 02160051
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    02IPSPECV825                         '. 02160051
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH2020HAT2038HA              '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VHU                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    03IPSPECV825                         '. 02160051
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH0045TV                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    01IPROCMVH0043HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD VU1                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH0019HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V52     HA                   '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH2036HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V22     HA                   '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH0006HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD V22                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVA0090HAH0001HAH0031HAH0038HA'. 00780047
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             S0215HAS5105HAS5110HAS5150HA'.
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             S9475HAS9970HAT1005HAT1013HA'.
           05  FILLER                              PIC X(57) VALUE      00770047
           '                             T2013HAT2036HAT2037HAT2038HA'.
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH2020HA                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    02IPSPECV825    827                  '. 02160051
           05  FILLER                              PIC X(57) VALUE      00770047
           '                    01IPROCMVH0018TJ                     '. 00780047
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    02IPMOD RU1     U2                   '. 01540000
           05  FILLER                              PIC X(57) VALUE      02190051
           '                    03IPSPECV826                         '. 02160051
           05  FILLER                              PIC X(57) VALUE      02190051
           '25 FQHC             00                                   '. 02200051
           05  FILLER                              PIC X(57) VALUE      02210051
           '                    01IPTYPEV43                          '. 02220051
           05  FILLER                              PIC X(57) VALUE      02230053
           '30 MEDICAL SUPPLIES 00                                   '. 02240053
           05  FILLER                              PIC X(57) VALUE      02250053
           '                    01ICTYPEV09                          '. 02260053
           05  FILLER                              PIC X(57) VALUE      02270053
           '                    02IPROC RA4000  A6499  A9150  A9300  '. 02280053
           05  FILLER                              PIC X(57) VALUE      02290053
           '                             B4000  B9999  X6000  X8199  '. 02300053
           05  FILLER                              PIC X(57) VALUE      02310053
           '                             X8201  X8999                '. 02320053
           05  FILLER                              PIC X(57) VALUE      02330053
           '31 DME              00                                   '. 02340053
           05  FILLER                              PIC X(57) VALUE      02350053
           '                    01ICTYPEV09                          '. 02360053
           05  FILLER                              PIC X(57) VALUE      02370052
           '32 HEARING AID      00                                   '. 02380053
           05  FILLER                              PIC X(57) VALUE      02390053
           '                    01ICTYPEV23                          '. 02400053
           05  FILLER                              PIC X(57) VALUE      02410049
           '40 HOME HEALTH      00                                   '. 02420049
           05  FILLER                              PIC X(57) VALUE      02430049
           '                    01ICTYPEV06                          '. 02440049
           05  FILLER                              PIC X(57) VALUE      02450065
           '                    01IPSPECV980                         '. 02460065
           05  FILLER                              PIC X(57) VALUE      02470049
           '                    02ICTYPEV18                          '. 02480065
           05  FILLER                              PIC X(57) VALUE      02490067
           '                    03ESPROGV09                          '. 02500067
           05  FILLER                              PIC X(57) VALUE      02510048
           '                    01IPROCMVS9122HAS5130HA              '. 02280053
           05  FILLER                              PIC X(57) VALUE      02510048
           '                    01IPROCMVT1016V1                     '. 02280053
           05  FILLER                              PIC X(57) VALUE      02510048
           '                    01IPROCMVT1016HDT1016TD              '. 02280053
           05  FILLER                              PIC X(57) VALUE      02510048
           '                    02IPMOD VV1                          '. 02280053
           05  FILLER                              PIC X(57) VALUE      02510048
           '50 HOSPICE          00                                   '. 02520048
           05  FILLER                              PIC X(57) VALUE      02530048
           '                    01IPTYPEV63                          '. 02540048
           05  FILLER                              PIC X(57) VALUE      02550051
           '60 LABORATORY       00                                   '. 02560051
           05  FILLER                              PIC X(57) VALUE      02570051
           '                    01ICTYPEV16                          '. 02580051
           05  FILLER                              PIC X(57) VALUE      02590051
           '                    01ICTYPEV04     13     22            '. 02600065
           05  FILLER                              PIC X(57) VALUE      02610051
           '                    02IPROC RG0054  G0060  P0000  P9999  '. 03020002
           05  FILLER                              PIC X(57) VALUE      03030002
           '                             Q0111  Q0116  W7000  W8899  '. 03040002
           05  FILLER                              PIC X(57) VALUE      03050002
           '                             W8901  W8999  80000  89999  '. 03060002
           05  FILLER                              PIC X(57) VALUE      03070002
           '                             U0001  U0005                '. 03060002
           05  FILLER                              PIC X(57) VALUE      03070002
           '                            VG0001  G0026  G0027  36415  '. 03080002
           05  FILLER                              PIC X(57) VALUE      03090002
           '                             36430  36440  36450  36455  '. 03100002
           05  FILLER                              PIC X(57) VALUE      03110002
           '                             36460  G2023  G2024         '. 03120002
           05  FILLER                              PIC X(57) VALUE      03130003
           '                    02IPROC RP0000  P9999  Q0111  Q0116  '. 02620051
           05  FILLER                              PIC X(57) VALUE      03150000
           '                             W8000  W8899  W8901  W8999  '. 03160000
           05  FILLER                              PIC X(57) VALUE      03170000
           '                             80000  89999                '. 03180000
           05  FILLER                              PIC X(57) VALUE      03190000
           '                            VG0001  80102  80173  82947  '. 03200000
           05  FILLER                              PIC X(57) VALUE      02630051
           '                             87850  U0005                '. 03220000
           05  FILLER                              PIC X(57) VALUE      02650052
           '                    01IPROCMVH0003HAH0049HA86580HA       '. 02280053
           05  FILLER                              PIC X(57) VALUE      02650052
           '65 RADIOLOGY        00                                   '. 02660052
           05  FILLER                              PIC X(57) VALUE      02670052
           '                    01ICTYPEV04     10                   '. 02680052
           05  FILLER                              PIC X(57) VALUE      02690052
           '                    02IPROC RR0000  R6999  W7000  W7999  '. 02700052
           05  FILLER                              PIC X(57) VALUE      02710052
           '                             70000  79999                '. 02720052
           05  FILLER                              PIC X(57) VALUE      02730048
           '70 TRANSPORTATION   00                                   '. 02740048
           05  FILLER                              PIC X(57) VALUE      02750048
           '                    01ICTYPEV07                          '. 02760048
           05  FILLER                              PIC X(57) VALUE      02770067
           '                    02ESPROGV09                          '. 02780067
           05  FILLER                              PIC X(57) VALUE      02790050
           '80 ADULT DAY HEALTH 00                                   '. 02800050
           05  FILLER                              PIC X(57) VALUE      02810050
           '                    01IPTYPEV92                          '. 02820050
           05  FILLER                              PIC X(57) VALUE      02830067
           '                    02ESPROGV09                          '. 02840067
           05  FILLER                              PIC X(57) VALUE      02850050
           '                    02EPROC VZ1860                       '. 02860050
           05  FILLER                              PIC X(57) VALUE      02870051
           '81APRSNL CARE - PHYS00                                   '. 02880051
           05  FILLER                              PIC X(57) VALUE      02890051
           '                    01IPROC RZ1600  Z1617                '. 02900051
           05  FILLER                              PIC X(57) VALUE      02910051
           '                            VT1001  S9122                '. 02900051
           05  FILLER                              PIC X(57) VALUE      02910051
           '                    02EPMOD VUC     ZI                   '. 03500000
           05  FILLER                              PIC X(57) VALUE      02930067
           '                    02ESPROGV09                          '. 02940067
           05  FILLER                              PIC X(57) VALUE      02950051
           '                    01IPROC VY9833                       '. 02960066
           05  FILLER                              PIC X(57) VALUE      02970067
           '                    02ESPROGV09                          '. 02980067
           05  FILLER                              PIC X(57) VALUE      02270053
           '                    01IPROCMVS5165HAT2028HAT2029HAT2039HA'. 02280053
           05  FILLER                              PIC X(57) VALUE      02990051
           '                    01IPROC V99199  S5111  S5120  S5125  '. 02900051
           05  FILLER                              PIC X(57) VALUE      02890051
           '                             S5165  S5170  S9122  T1019  '. 02900051
           05  FILLER                              PIC X(57) VALUE      02890051
           '                             T1999  T2003  T2015  T2025  '. 02900051
           05  FILLER                              PIC X(57) VALUE      02890051
           '                             T2028  T2035  T2039  T2041  '. 02900051
           05  FILLER                              PIC X(57) VALUE      02890051
           '                             T5999                       '. 02900051
           05  FILLER                              PIC X(57) VALUE      02910051
           '                    02IPMOD VSE                          '. 03500000
           05  FILLER                              PIC X(57) VALUE      02990051
           '                    01IPROC VT1019  T1020                '. 02900051
           05  FILLER                              PIC X(57) VALUE      02990051
           '81BPRSNL CARE - MH  00                                   '. 03000051
           05  FILLER                              PIC X(57) VALUE      03010051
           '                    01IPROC RZ1600  Z1605  Z1610  Z1613  '. 03020051
           05  FILLER                              PIC X(57) VALUE      03010051
           '                            VT1001                       '. 03020051
           05  FILLER                              PIC X(57) VALUE      03030051
           '                    02IPMOD VUC     ZI                   '. 03620000
           05  FILLER                              PIC X(57) VALUE      03050067
           '                    03ESPROGV09                          '. 03060067
           05  FILLER                              PIC X(57) VALUE      03070051
           '81CADULT MH REHAB   00                                   '. 03080051
           05  FILLER                              PIC X(57) VALUE      03090051
           '                    01IPROC RZ7333  Z7338                '. 03100051
           05  FILLER                              PIC X(57) VALUE      03110067
           '                    02ESPROGV09                          '. 03120067
           05  FILLER                              PIC X(57) VALUE      03130048
           '                    01IPROCMVH0019U1H0019U2H0019U3H0019U4'. 03100051
           05  FILLER                              PIC X(57) VALUE      03090051
           '                             H0019U5                     '. 03100051
           05  FILLER                              PIC X(57) VALUE      03110067
           '                    02ESPROGV09                          '. 03120067
           05  FILLER                              PIC X(57) VALUE      03090051
           '                    01IPROCMVH0019U1H0019U2H0019U3H0019U4'. 03100051
           05  FILLER                              PIC X(57) VALUE      03110067
           '                    02IPMOD V52                          '. 03120067
           05  FILLER                              PIC X(57) VALUE      03110067
           '                    03ESPROGV09                          '. 03120067
           05  FILLER                              PIC X(57) VALUE      03130048
           '87 DHSS/ECO WAIVER  00                                   '. 03140049
           05  FILLER                              PIC X(57) VALUE      03150049
           '                    01IPTYPEV35                          '. 03160049
           05  FILLER                              PIC X(57) VALUE      03170048
           '                    02ISPROGR28     32     34     36     '. 03180049
           05  FILLER                              PIC X(57) VALUE      03190048
           '                            V22     62                   '. 03200048
           05  FILLER                              PIC X(57) VALUE      03210049
           '                    01ISPROGV22     31     32            '. 03220049
           05  FILLER                              PIC X(57) VALUE      03230049
           '                    02IPSPECV760    862    980    982    '. 03240049
           05  FILLER                              PIC X(57) VALUE      03250048
           '                    01ISPROGV33                          '. 03220049
           05  FILLER                              PIC X(57) VALUE      03230049
           '                    02IPSPECV845    846    847    848    '. 03240049
           05  FILLER                              PIC X(57) VALUE      03230049
           '                             851                         '. 03240049
           05  FILLER                              PIC X(57) VALUE      03250048
           '                    01IPSPECV812    814                  '. 03240049
           05  FILLER                              PIC X(57) VALUE      03210049
           '                    02ISPROGV32                          '. 03220049
           05  FILLER                              PIC X(57) VALUE      03250048
           '88 TBI              00                                   '. 03260048
           05  FILLER                              PIC X(57) VALUE      03270048
           '                    01ISPROGV17                          '. 03280048
           05  FILLER                              PIC X(57) VALUE      03290048
           '                    02IPROC RY7433  Y7570                '. 03300048
           05  FILLER                              PIC X(57) VALUE      03310051
           '                            VS5109  Y7733  S5165         '. 03930001
           05  FILLER                              PIC X(57) VALUE      03940000
           '                    02IPROCMVS5101STS5102STS5120STS5199HI'. 03900000
           05  FILLER                              PIC X(57) VALUE      03910000
           '                             S8990STT1028HI97535STT2025ST'. 03920000
           05  FILLER                              PIC X(57) VALUE      03930000
           '                    02IPROCMVH0004STS5135ST97532ST       '. 03940000
           05  FILLER                              PIC X(57) VALUE      03950000
           '                    03IPMOD V22                          '. 03960000
           05  FILLER                              PIC X(57) VALUE      03970000
           '                    02IPROCMVS9129HQS9131HQS9128HQT2012HQ'. 03940000
           05  FILLER                              PIC X(57) VALUE      03950000
           '                    03IPMOD VST                          '. 03960000
           05  FILLER                              PIC X(57) VALUE      03970000
           '89 ABC WAIVER       00                                   '. 03320051
           05  FILLER                              PIC X(57) VALUE      03330051
           '                    01IPSPECV831                         '. 03340051
           05  FILLER                              PIC X(57) VALUE      03350067
           '                    02ESPROGV09                          '. 03360067
           05  FILLER                              PIC X(57) VALUE      03370050
           '90 DDD              00                                   '. 03380050
           05  FILLER                              PIC X(57) VALUE      03390050
           '                    01IPTYPEV95                          '. 03400050
           05  FILLER                              PIC X(57) VALUE      03410050
           '                    01IPTYPEV44                          '. 03400050
           05  FILLER                              PIC X(57) VALUE      03390050
           '                    02IPSPECV871    872    873    874    '. 03400050
           05  FILLER                              PIC X(57) VALUE      03390050
           '                             875    876    877    878    '. 03400050
           05  FILLER                              PIC X(57) VALUE      03390050
           '                             879    881    882    883    '. 03400050
           05  FILLER                              PIC X(57) VALUE      03390050
           '                             884    885    886    887    '. 03400050
           05  FILLER                              PIC X(57) VALUE      03390050
           '                             888    889    971    972    '. 03400050
           05  FILLER                              PIC X(57) VALUE      03470050
           '                             973    974    975    976    '. 03400050
           05  FILLER                              PIC X(57) VALUE      03470050
           '                    03ISPROGV07     46                   '. 03480050
           05  FILLER                              PIC X(57) VALUE      03410050
           '91 CCPED            00                                   '. 03420050
           05  FILLER                              PIC X(57) VALUE      03430050
           '                    01ISPROGV08                          '. 03440050
           05  FILLER                              PIC X(57) VALUE      03450050
           '92 ACCAP            00                                   '. 03460050
           05  FILLER                              PIC X(57) VALUE      03470050
           '                    01ISPROGV05                          '. 03480050
           05  FILLER                              PIC X(57) VALUE      03490050
           '                    02IPROC RZ1710  Z1745  Z1800  Z1899  '. 03500050
           05  FILLER                              PIC X(57) VALUE      03510050
           '                    02IPROCMVS5199HIT1028HIS912352S912452'. 03900000
           05  FILLER                              PIC X(57) VALUE      03940000
           '                    02IPROCMVS9123TDS9123TVS9124TES9124TV'. 03900000
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    03IPMOD V52                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      03510050
           '93ACRPD - NOT USED  00                                   '. 03520050
           05  FILLER                              PIC X(57) VALUE      03530050
           '                    01ISPROGV04                          '. 03540050
           05  FILLER                              PIC X(57) VALUE      03550050
           '                    02IPROC RZ1700  Z1745                '. 03560050
           05  FILLER                              PIC X(57) VALUE      03570050
           '93BCRPD - NO PDN    00                                   '. 03580050
           05  FILLER                              PIC X(57) VALUE      03590050
           '                    01ISPROGV06                          '. 03600050
           05  FILLER                              PIC X(57) VALUE      03610050
           '                    02IPROC RZ1700  Z1745                '. 03620050
           05  FILLER                              PIC X(57) VALUE      03630050
           '                            VS5160  S5161  S5162  S5165  '. 03620050
           05  FILLER                              PIC X(57) VALUE      03630050
           '                    02IPROCMVS5199HIT1028HI              '. 03900000
           05  FILLER                              PIC X(57) VALUE      03630050
           '93CCRPD - PDN       00                                   '. 03640050
           05  FILLER                              PIC X(57) VALUE      03650050
           '                    01ISPROGV03                          '. 03660050
           05  FILLER                              PIC X(57) VALUE      03670050
           '                    02IPROC RZ1700  Z1745                '. 03680050
           05  FILLER                              PIC X(57) VALUE      03690048
           '                            VS5160  S5161  S5162  S5165  '. 03620050
           05  FILLER                              PIC X(57) VALUE      03940000
           '                    02IPROCMVS5199HIT1028HIS912352S912452'. 03900000
           05  FILLER                              PIC X(57) VALUE      03940000
           '                    02IPROCMVS9123TDS9123TVS9124TES9124TV'. 03900000
           05  FILLER                              PIC X(57) VALUE      01330062
           '                    03IPMOD V52                          '. 01540000
           05  FILLER                              PIC X(57) VALUE      03690048
           '94 GSHP             00                                   '. 03700048
           05  FILLER                              PIC X(57) VALUE      03710048
           '                    01IGSHP R5      9                    '. 03720048
           05  FILLER                              PIC X(57) VALUE      03730048
           '                            V1      2                    '. 03740048
           05  FILLER                              PIC X(57) VALUE      03750048
           '95 PREPAID HEALTH   00                                   '. 03760048
           05  FILLER                              PIC X(57) VALUE      03770048
           '                    01IPTYPEV37                          '. 03780048
           05  FILLER                              PIC X(57) VALUE      03790047
           '96 HOME CARE EXP    00                                   '. 03800048
           05  FILLER                              PIC X(57) VALUE      03810047
           '                    01ISPROGV09                          '. 03820048
           05  FILLER                              PIC X(57) VALUE      03790047
           '99 DEFAULT          00                                   '.
           05  FILLER                              PIC X(57) VALUE      03830056
           '                    01IPROC VT1027  S9482                '.
           05  FILLER                              PIC X(57) VALUE      03830056
           '                    02IPMOD VUN     UP                   '.
           05  FILLER                              PIC X(57) VALUE      03830056
           '                    02EPMOD RAA     99                   '.
           05  FILLER                              PIC X(57)            03830056
               VALUE HIGH-VALUES.                                       03840056
       01  FILLER REDEFINES COS-MATRIX.                                 03850047
           05  M-ENTRY OCCURS 370                                       04570001
               INDEXED BY NDX1 NDX2 NDX3 NDX4.                          03870071
               10  M-MODCOS                        PIC X(03).           03880068
               10  M-MODCOS-DESC                   PIC X(17).           03890047
               10  M-LEVEL                         PIC X(02).           03900068
               10  M-LEVEL-N REDEFINES M-LEVEL     PIC 9(02).           03910068
               10  M-INCL-EXCL                     PIC X(01).           03920047
                   88  INCLUDE                 VALUE 'I'.               03930073
                   88  EXCLUDE                 VALUE 'E'.               03940073
               10  M-DATA-ELEMENT                  PIC X(05).           03950047
                   88  CLAIM-TYPE              VALUE 'CTYPE'.           03960073
                   88  CLINIC-CODE             VALUE 'CLINC'.           03961076
                   88  FACILITY-CONTROL-CODE   VALUE 'FACCC'.           03970073
                   88  PROCEDURE-CODE          VALUE 'PROC '.           03980073
                   88  PROCEDURE-AND-MODS      VALUE 'PROCM'.           03990073
                   88  PROCEDURE-MOD-ONLY      VALUE 'PMOD '.           04000074
                   88  PROGRAM-STATUS          VALUE 'PSTAT'.           04010073
                   88  PROVIDER-SPECIALTY      VALUE 'PSPEC'.           04020073
                   88  PROVIDER-TYPE           VALUE 'PTYPE'.           04030073
                   88  SPECIAL-PROGRAM         VALUE 'SPROG'.           04040073
               10  M-RANGE-OR-LIST                 PIC X(01).           04050047
                   88  RANGE                   VALUE 'R'.               04060073
                   88  LIST-OR-VALUE           VALUE 'V'.               04070073
               10  M-RANGE-1.                                           04080047
                   15  M-VALUE-1                   PIC X(07).           04090047
                   15  M-VALUE-2                   PIC X(07).           04100047
               10  M-RANGE-2.                                           04110047
                   15  M-VALUE-3                   PIC X(07).           04120047
                   15  M-VALUE-4                   PIC X(07).           04130047
